app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date
---
  def index
    @all_ratings = Movie.all_ratings
    if params[:ratings]
	    @ratings_hash = params[:ratings]
	    @ratings_array = params[:ratings].keys
	    session[:ratings] = @ratings_hash
    elsif session[:ratings]
	    flash.keep
	    redirect_to params.merge(:ratings => session[:ratings])
    else
	    @ratings_hash = {}
	    @ratings_array = @all_ratings
    end
    #hw2 part 1.b
    #if someone clicks on title, sorts and highlights
    #if someone clicks on release date, sorts and hightlights
    if params[:sort_param]
	session[:sort_param] = params[:sort_param]
	if (params[:sort_param] == "title")
		@title_header_class = 'hilite'
	elsif (params[:sort_param] == "release_date")
		@release_date_header_class = 'hilite'
	end
    elsif session[:sort_param] && params[:ratings]
	    flash.keep
      redirect_to params.merge(:sort_param => session[:sort_param])
    end

   @movies = Movie.find_all_by_rating(@ratings_array, :order => session[:sort_param])